#include "Headers.h"                                                 //подключение библиотеки

void clean_memory(char* &str_s, char* &str_a, char* &str_del)           //функци€ чистки пам€ти
{
	free(str_del);                                                   //очистка пам€ти от указателс€ на строку удаленных символов
	free(str_s);                                                     //освобождение пам€ти от указател€ на строку s  
	free(str_a);                                                     //освобождение пам€ти от указател€ на строку а
}