#include "Header.h" //подключение библиотеки

void output_table(int n, person *man) //функция вывода введенной информации о людях
{
	int k = 0;      //счётчик
	//вывод заголовка таблицы
	while (k++ < 47) printf(" ");
	printf("Общая информация\n");
	k = 0;
	//рисовка верхней границы таблицы
	printf(" ");
	while (k++ < 116) printf("_");
	k = 110;
	//вывод "шапки" таблицы
	printf("\n|Имя\t\t");
	printf("|Фамилия\t");
	printf("|Возраст");
	printf("|Доллары       ");
	printf("|Евро          ");
	printf("|Рос. рубли    ");
	printf("|Бел. рубли    ");
	printf("|Всего денег(BYN)|\n|");
	//подрисовка верхней границы таблицы
	while (k-- > 1) {
		if (k == 16 || k == 30 || k == 44 || k == 58 || k == 72 || k == 79 || k == 94) printf("|");
		printf("_");
	}
	printf("|");

	//заполнение таблицы информацией
	for (int i = 0; i < n; i++)
	{
		printf("\n|%-15s", man[i].name);   //вывод имени
		printf("|%-15s", man[i].surname);  //вывод фамилии
		printf("|%-3d    ", man[i].age);            //вывод возраста
		printf("|%-14.2lf", man[i].money[0].dollar);//вывод долларов
		printf("|%-14.2lf", man[i].money[1].euro);  //вывод евро
		printf("|%-14.2lf", man[i].money[2].RUB);   //вывод росссийских рублей
		printf("|%-14.2lf|", man[i].money[3].BYN);  //вывод белорусских рублей
		printf("%16.2lf|", perevod(man, i));        //вывод полной суммы всех денег, переведенной на белорусские рубли
	}
	//рисовка нижней границы таблицы
	printf("\n|");
	while (k++ < 109) {
		if (k == 94 || k == 80 || k == 66 || k == 52 || k == 38 || k == 31 || k == 16) printf("|");
		printf("_");
	}
	puts("|");
}